app/controllers/songs_controller.rb

  def create
    binding.pry
    @song = Song.new(song_params)
    # @artist = Artist.find_or_create_by(name: params[:artist_name])


    if @song.save
---
INSERT INTO "songs" ("title", "artist_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Song 2"], ["artist_id", 1], ["created_at", "2016-01-27 00:20:14.516774"], ["updated_at", "2016-01-27 00:20:14.516774"]]